In [1]:
import pandas as pd
import numpy as np

In [2]:
time = pd.read_csv('../../../data/messages.csv')

In [3]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [4]:
time.drop(columns='msg',inplace=True)

In [5]:
time.head()

                  date
0  2013-12-15 00:50:00
1  2014-04-29 23:40:00
2  2012-12-30 00:21:00
3  2014-11-28 00:31:00
4  2013-10-26 23:11:00

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
dtypes: object(1)
memory usage: 7.9+ KB

In [7]:
# converting to datetime datatype

time['date'] = pd.to_datetime(time['date'])

In [8]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

In [56]:
time['hour'] = time['date'].dt.hour
time['minute'] = time['date'].dt.minute
time['second'] = time['date'].dt.second

time.sample(5)

                   date  hour  minute  second
729 2012-06-25 00:03:00     0       3       0
586 2014-10-26 23:29:00    23      29       0
706 2012-03-06 23:55:00    23      55       0
83  2014-02-07 23:14:00    23      14       0
702 2016-09-12 22:55:00    22      55       0

In [57]:
# Extract only time part form datetime

time['time'] = time['date'].dt.time

time.head()

                 date  hour  minute  second      time
0 2013-12-15 00:50:00     0      50       0  00:50:00
1 2014-04-29 23:40:00    23      40       0  23:40:00
2 2012-12-30 00:21:00     0      21       0  00:21:00
3 2014-11-28 00:31:00     0      31       0  00:31:00
4 2013-10-26 23:11:00    23      11       0  23:11:00

In [58]:
# time difference

import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 11, 5, 22, 38, 47, 644081)

In [60]:
today-time['date']

0     4343 days 21:48:47.644081
1     4207 days 22:58:47.644081
2     4693 days 22:17:47.644081
3     3995 days 22:07:47.644081
4     4392 days 23:27:47.644081
                 ...
995   4982 days 21:48:47.644081
996   4303 days 23:24:47.644081
997   4768 days 23:01:47.644081
998   4884 days 23:04:47.644081
999   4156 days 23:13:47.644081
Name: date, Length: 1000, dtype: timedelta64[ns]

In [62]:
# time differnce in hours

time['hour_diff']= (today-time['date'])/np.timedelta64(1,'h')

time.head()

                 date  hour  minute  second      time      hour_diff
0 2013-12-15 00:50:00     0      50       0  00:50:00  104253.813234
1 2014-04-29 23:40:00    23      40       0  23:40:00  100990.979901
2 2012-12-30 00:21:00     0      21       0  00:21:00  112654.296568
3 2014-11-28 00:31:00     0      31       0  00:31:00   95902.129901
4 2013-10-26 23:11:00    23      11       0  23:11:00  105431.463234